<?php
return [
    'groups' => [
        'user' => 'Пользователи',
        'category' => 'Категории',
        'topic' => 'Топик',
        'moderate' => 'Модерация',
        'admin' => 'Администрация',
        'post' => 'Посты',
        'role' => 'Роли',

    ],

    // Категории
    'category.view' => 'Просмотр категорий',
    'category.create' => 'Создание категорий',
    'category.edit' => 'Редактирование категорий',
    'category.delete' => 'Удаление категорий',

    // Темы
    'topic.view' => 'Просмотр тем',
    'topic.create' => 'Создание тем',
    'topic.edit' => 'Редактирование тем',
    'topic.delete' => 'Удаление тем',
    'topic.lock' => 'Закрытие тем',
    'topic.pin' => 'Закрепление тем',
    'topic.unpin' => 'Открепление тем',

    // Сообщения
    'post.view' => 'Просмотр сообщений',
    'post.create' => 'Создание сообщений',
    'post.edit' => 'Редактирование сообщений',
    'post.delete' => 'Удаление сообщений',

    // Жалобы
    'report.view' => 'Просмотр жалоб',
    'report.resolve' => 'Обработка жалоб',
    'report.delete' => 'Удаление жалоб',

    // Пользователи
    'user.view' => 'Просмотр пользователей',
    'user.edit' => 'Редактирование пользователей',
    'user.delete' => 'Удаление пользователей',

    // Роли
    'role.view' => 'Просмотр ролей',
    'role.create' => 'Создание ролей',
    'role.edit' => 'Редактирование ролей',
    'role.delete' => 'Удаление ролей',


];
